Repository: 84000/data-translation-memory
Catalog: toh55_84000-the-teaching-on-the-effulgence-of-light.tmx
Source language: bo
Languages: en

source: །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་ཤོག །དེ་བཞིན་གཤེགས་པས་ཆོས་ཉིད་སྒྱུ་མ་དང་། །རྨི་ལམ་སྨིག་རྒྱུ་ལྟ་བུར་རབ་ཏུ་མཁྱེན།
en: And benefit all the world! “The Thus-Gone One clearly knows that, by nature, Phenomena are like illusions, dreams, and mirages;

source: །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་ཤོག །དེ་བཞིན་གཤེགས་པས་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི།
en: And benefit all the world! “The Thus-Gone One clearly knows

source: །ཡི་གེ་དག་དང་བརྗོད་པ་རབ་ཏུ་མཁྱེན།
en: The words and expressions of the whole world;

source: །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་ཤོག །དེ་བཞིན་གཤེགས་པ་སྤོབས་པ་མཆོག་ལྡན་པས།
en: And benefit all the world! “Since he is endowed with supreme eloquence,

source: །དམ་ཆོས་ཟབ་མོ་དག་ནི་སྟོན་པར་མཛད།
en: The Thus-Gone One teaches the profound, sacred Dharma;

source: །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་ཤོག །དེ་བཞིན་གཤེགས་པ་སྐུ་གསུང་ཐུགས་དུལ་པས།
en: And benefit all the world! “Since his body, speech, and mind are calm,

source: །ཐམས་ཅད་ཡེ་ཤེས་རྗེས་སུ་འབྲང་བར་མཛད།
en: The Thus-Gone One always acts based on wisdom;

source: །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་ཤོག །དེ་བཞིན་གཤེགས་པས་དུས་གསུམ་རབ་མཁྱེན་པས།
en: And benefit all the world! “Since he clearly knows the three times,

source: །འཛིན་དང་ཆགས་པ་མི་མངའ་ཐོགས་མི་མངའ།
en: The Thus-Gone One is free from clinging, attachment, and impediment;

source: །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་ཤོག །དེ་བཞིན་གཤེགས་པས་ཚུལ་ཁྲིམས་ཏིང་འཛིན་དང་། །ཤེས་རབ་བསྒྲུབས་པས་དེ་ལས་ལྡོག་མི་འགྱུར།
en: And benefit all the world! “Since he has accomplished discipline, absorption, and insight, The Thus-Gone One will never regress from those;

source: །ཁམས་གསུམ་ཐུགས་རྗེ་ཆེན་པོའི་གཙོར་གྱུར་ཅིག །དེ་བཞིན་གཤེགས་པས་རྣམ་གྲོལ་རབ་བསྒྲུབས་པས།
en: And become the most compassionate being in the three realms! “Since he has accomplished the liberations,

source: །རྣམ་གྲོལ་མཁྱེན་དང་གཟིགས་པ་ལྡོག་མི་མངའ།
en: The Thus-Gone One’s liberated wisdom and realization are irreversible;

source: །ཁམས་གསུམ་ཐུགས་རྗེ་ཆེན་པོའི་གཙོར་གྱུར་ཅིག །དེ་བཞིན་གཤེགས་པས་ཞི་གནས་ལྷག་མཐོང་བསྒྲུབས།
en: And become the most compassionate being in the three realms! “Since he has accomplished tranquility and insight,

source: །ལྷ་མི་འཇིག་རྟེན་དག་ན་མཚུངས་མ་མཆིས།
en: The Thus-Gone One is unequaled within the worlds of gods and humans;

source: །ཁམས་གསུམ་ཐུགས་རྗེ་ཆེན་པོའི་གཙོར་གྱུར་ཅིག །དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་པས།
en: And become the most compassionate being in the three realms! “Since he is endowed with supreme wisdom,

source: །འཇིག་རྟེན་ཆོས་རྣམས་ལ་ནི་ཞེན་མི་མངའ།
en: The Thus-Gone One does not cling to worldly concerns;

source: །ཁམས་གསུམ་ཐུགས་རྗེ་ཆེན་པོའི་གཙོར་གྱུར་ཅིག །དེ་བཞིན་གཤེགས་པས་འཇིག་རྟེན་མཁྱེན་ལྡན་པས།
en: And become the most compassionate being in the three realms! “Since he knows the world,

source: །འགྲོ་བ་སྣ་ཚོགས་དག་ནི་གསལ་བར་གཟིགས།
en: The Thus-Gone One clearly sees all the various destinies;

source: །འགྲོ་བ་དེ་ལ་ཐེ་ཚོམ་མ་མཆིས་ཤོག །དེ་བཞིན་གཤེགས་པ་སྐྱེ་ཟད་མཐའ་མཁྱེན་པས།
en: And be free from doubts about those destinies! “Since he knows the limits of arising and exhaustion,

source: །དེ་སླད་དེ་ལ་རྨོངས་པ་ཡོང་མི་མངའ།
en: The Thus-Gone One is free from delusion about them;

source: །སྐྱེ་ཟད་ཉིད་ལ་ཐེ་ཚོམ་མ་མཆིས་ཤོག །དེ་བཞིན་གཤེགས་པས་རབ་ཞི་མཐའ་མཁྱེན་པས།
en: And be free from doubts about the nature of arising and exhaustion! “Since he knows the limit of complete peace,

source: །རབ་ཞི་དེ་ལ་ཐེ་ཚོམ་མ་མཆིས་ཤོག །དེ་བཞིན་གཤེགས་པ་འཁོར་བའི་མཐའ་མཁྱེན་པས།
en: And be free from doubts about that complete peace! “Since he knows the limit of saṃsāra,

source: །འཁོར་བ་དེ་ལ་ཐེ་ཚོམ་མ་མཆིས་ཤོག །དེ་བཞིན་གཤེགས་པས་སྔོན་དང་ཕྱི་མཐའ་མཁྱེན།
en: And be free from doubts about saṃsāra! “Since he knows the past and future limits,

source: །དེ་སླད་སློབ་དཔོན་མ་མཆིས་མཁྱེན་དང་ལྡན།
en: The Thus-Gone One has attained self-taught wisdom;

source: །སྔ་ཕྱིའི་མཐའ་ལ་ཐེ་ཚོམ་མ་མཆིས་ཤོག །དེ་བཞིན་གཤེགས་པས་སྐྱོན་ཟློག་མཐའ་རབ་མཁྱེན།
en: And be free from doubts about the past and future limits! “Since he knows the limit of the faultless state,

source: །སྐྱོན་ཟློག་དེ་ལ་ཐེ་ཚོམ་མ་མཆིས་ཤོག །དེ་བཞིན་གཤེགས་པས་སྔོན་དང་ཕྱི་མཐའ་མཁྱེན།
en: And be free from doubts about that faultless state! “Since he knows the past and future limits,

source: །མིག་གི་རྟག་ཆད་དག་ལ་འཛིན་མི་མངའ།
en: The Thus-Gone One does not cling to permanence or discontinuation of the eye;

source: །སྔ་ཕྱི་མཐའ་ལ་ཐེ་ཚོམ་མ་མཆིས་ཤོག །དེ་བཞིན་གཤེགས་པས་སྐྱེ་ཟད་མཐའ་མཁྱེན་པས།
en: And be free from doubts about the past and future limits! “Since he knows the limits of arising and exhaustion,

source: །སྐྱེ་ཟད་ཉིད་ལ་ཐེ་ཚོམ་མ་མཆིས་ཤོག །གང་ཞིག་སྔོན་དང་ཕྱི་མཐའ་མ་རྟོགས་པས།
en: And be free from doubts about the nature of arising and exhaustion! “Those who do not understand the past and future limits

source: །དེས་ནི་འདོད་པ་དག་ལ་ཞེན་པ་སྐྱེད།
en: Generate clinging toward objects of desire;

source: །དེ་བཞིན་གཤེགས་པས་དེ་ནི་རབ་མཁྱེན་པས།
en: Since the Thus-Gone One clearly knows these,

source: །དེ་སླད་འདོད་པ་དག་ལ་ཞེན་མི་མངའ།
en: He does not cling to objects of desire.

source: །གང་ཞིག་ཡོད་མེད་མཐའ་ནི་མ་རྟོགས་པ།
en: “Those who do not understand the limits of existence and nonexistence

source: །གང་ཞིག་ཟད་དང་མི་ཟད་མ་རྟོགས་པ།
en: “Those who do not understand exhaustion and non-exhaustion

source: །གང་ཞིག་འཇུག་དང་མི་འཇུག་མ་རྟོགས་པ།
en: “Those who do not understand engagement and nonengagement

source: །ཞེ་སྡང་གཏི་མུག་ཁོང་ཁྲོ་འཆབ་པ་དང་། །གཡོ་སྒྱུ་ཕྲག་དོག་ང་རྒྱལ་ཁེངས་པ་དང་། །སྦྱིན་དང་ཚུལ་ཁྲིམས་བཟོད་དང་བརྩོན་འགྲུས་དང་། །བསམ་གཏན་ཤེས་རབ་དག་ཀྱང་དེ་བཞིན་ནོ།
en: “The same applies to anger, ignorance, aggression, Pretense, deceit, envy, pride, haughtiness, Generosity, discipline, patience, Diligence, concentration, and insight.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པའི་སེམས་ཀྱི་རྟོག་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས་འཛུམ་པ་མཛད་དེ། འོད་ཟེར་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་རབ་ཏུ་བཀྱེའོ། །འོད་ཟེར་དེས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་དཔག་ཏུ་མེད་པ་རྣམས་སྣང་བར་བྱས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཏུ་ཕན་པ་དག་བྱས་ནས།
en: Aware of Candraprabhakumārabhūta’s thoughts, the Blessed One smiled and emitted golden light rays that illuminated countless buddha realms and accomplished the benefit of beings within the worldly realms.

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: Then those light rays circumambulated the Blessed One three times and vanished into the top of the Thus-Gone One’s head.

source: དེ་བཞིན་གཤེགས་པའི་གཙུག་ཏོར་ཉིད་དུ་ཐིམ་པར་གྱུར་ཏོ། །དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་འདུག་པའི་སྟན་ལས་ལངས་ནས། །བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ།
en: At that moment, the bodhisattva Maitreya stood up, draped his shawl over one shoulder, knelt on his right knee, and prostrated to the feet of the Blessed One.

source: གུས་པས་ཐལ་མོ་སྦྱར་ནས། ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དེ། བཅོམ་ལྡན་འདས་ལ་ཞུ་བ་ཞུས་པ།
en: With his palms respectfully joined together, he praised the Blessed One and posed some questions with these verses:

source: འབྲུག་དང་སེང་གེའི་སྒྲ་སྒྲོགས་ཤིང་།
en: “You roar like thunder and like a lion,

source: །ཀ་ལ་པིང་ཀའི་སྒྲ་ཕྱུང་བས།
en: Your voice resembles the song of the kalaviṅka bird,

source: །ཆོས་རྔ་ཆེན་པོའི་སྒྲ་འབྱིན་པ།
en: And you beat the great Dharma drums.

source: །ཅི་ཡི་སླད་དུ་འཛུམ་པ་མཛད།
en: Why do you smile?

source: །ཉི་མ་སྟོང་བས་ཁྱད་པར་འཕགས།
en: “You shine more brightly than a thousand suns,

source: །རྣམ་པར་སྒྲ་རབ་དག་དང་ལྡན།
en: Your voice is immaculate,

source: །ཡོན་ཏན་ངོ་མཚར་རབ་མངའ་བ།
en: And you possess the most amazing qualities.

source: །ཅི་སླད་འོད་ཟེར་བཀྱེ་བ་མཛད།
en: Why did you emit light?

source: །སྦྱིན་དང་ཚུལ་ཁྲིམས་བཟོད་བརྩོན་འགྲུས།
en: “You are adorned with generosity, discipline, patience,

source: །བསམ་གཏན་ཤེས་རབ་རབ་བརྒྱན་པས།
en: Diligence, concentration, and insight.

source: །ཐམས་ཅད་དག་ནི་ཡོངས་རྫོགས་པས།
en: You have mastered all those perfections.

source: །དེ་བཞིན་གཤེགས་པ་དབྱངས་མཉེན་པས།
en: “Thus-Gone One, your voice is soft,

source: །ངག་རྩུབ་རྣམས་ནི་རྟག་ཏུ་སྤངས།
en: You have permanently abandoned harsh words,

source: །སེམས་ཅན་ནད་ནི་ལེགས་གསོ་བ།
en: And you heal the diseases of sentient beings.

source: །ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་གཙོ།
en: “Great compassionate one, leader of human beings,

source: །མིག་ནི་རྟག་ཏུ་སྟོང་དབེན་མཁྱེན། །རྣམ་དག་ཚངས་པའི་དབྱངས་མངའ་བས།
en: You realize that the eye is always empty and void,

source: །སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་མཛད།
en: And you teach the Dharma to sentient beings With your pure Brahmā voice. “The same applies to the ear, the nose, the tongue,

source: །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །སྒྲ་དང་མིང་ལ་སོགས་པ་ནས།
en: The body, the mind, words, names, and so forth, Up to the origin, cessation,

source: །ཀུན་འབྱུང་འགོག་པ་ལམ་དག་དང་། །ཡེ་ཤེས་བཟོད་པའི་བར་དེ་བཞིན།
en: The path, wisdom, and patience.

source: །མིག་ཟད་སྐྱེ་བའི་མཐའ་དག་དང་། །རབ་ཞི་དག་ནི་འཁོར་བ་དག །ཐམས་ཅད་སྟོང་དབེན་ཉིད་དུ་མཁྱེན།
en: You realize that the limits of the arising and exhaustion of the eye And complete peace, as well as saṃsāra, Are empty and void. “The same applies to the ear, the nose,

source: །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད།
en: The tongue, the body, the mind,

source: །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ནས།
en: Forms, sounds, scents, tastes, and textures,

source: །སྒྲ་དང་མིང་ལ་སོགས་པའི་བར། །ཐམས་ཅད་ཀྱང་ནི་དེ་བཞིན་ནོ།
en: Up to words and names.

source: །གཞན་ཡང་རྟེན་ཅིང་འབྲེལ་འབྱུང་ཆོས།
en: “You also teach that dependently arisen phenomena

source: །ཆད་དང་རྟག་པ་ཡོངས་བྲལ་ནས།
en: Are beyond permanence and discontinuation,

source: །བདག་དང་གཞན་གྱིས་བྱས་མིན་པས།
en: And that they are not produced by themselves or by others,

source: །རྐྱེན་བབ་ལས་བྱུང་ཉིད་དུ་གསུང་། །རེས་འགའ་རྣམ་གྲངས་སྣ་ཚོགས་ཀྱིས།
en: But that they originate from numerous conditions.

source: །སྡུག་བསྔལ་གཞི་ནི་སྟོན་པར་མཛད།
en: “At times, you describe the basis of suffering

source: །རེས་འགའ་དོན་ནི་སྣ་ཚོགས་ཀྱིས།
en: Using various explanations.

source: །སངས་རྒྱས་འོད་ཟེར་བསྔགས་པར་མཛད།
en: At times, you praise the light of the buddhas According to a variety of meanings. “At times, you teach about the disengagement of phenomena

source: །རེས་འགའ་ཚིག་ནི་ཚད་མེད་ཀྱིས། །རབ་དབེན་ཆོས་ནི་སྟོན་མཛད་ཅིང་།
en: Using countless words.

source: །གང་ཟག་སྲོག་དང་བདག་མེད་དང་། །སེམས་ཅན་མེད་པ་ཉིད་དུ་སྟོན།
en: At times, you reveal the nonexistence Of a person, a life principle, a self, and a sentient being.

source: །འདས་པའི་སངས་རྒྱས་ཚད་མེད་ཀྱང་།
en: “Countless buddhas of the past Have also taught this Dharma

source: །བསམ་གྱིས་མི་ཁྱབ་པ་དག་གི། །ཚིགས་སུ་བཅད་པ་བརྒྱ་སྟོང་གིས།
en: Through hundreds of thousands Of inconceivable verses.

source: །དེ་འདྲའི་ཆོས་ནི་སྟོན་པར་མཛད།
en: “The Thus-Gone One teaches

source: །དེ་བཞིན་གཤེགས་པས་ཡོན་ཏན་ཆོས།
en: About qualities, the Dharma, and the natural state,

source: །ཡང་དག་ཉིད་ནི་སྟོན་མཛད་ཀྱང་། །རྗོད་དང་བརྗོད་བྱ་མི་མངའ་བས།
en: But he is beyond expressions and things expressed.

source: །བརྗོད་མཛད་ཆོས་ཀྱང་ཡོང་མི་མངའ།
en: Therefore, the Dharma that he expresses is also nonexistent. “Blessed One, since you induce understanding in beings

source: །བཅོམ་ལྡན་ཡང་དག་ཆོས་གསུང་ཞིང་། །སྐྱེ་དགུ་རྣམས་ནི་གོ་མཛད་པས།
en: By teaching the true Dharma,

source: །ལྷ་རྣམས་དང་ནི་གནོད་སྦྱིན་དག །གང་ཐོས་དེ་དག་རྟོགས་པར་འགྱུར།
en: The gods and yakṣas who hear your teachings Will gain understanding.

source: །ལྷ་མ་ཡིན་ནི་ཐམས་ཅད་ཀྱང་།
en: “Likewise, all the asuras

source: །མོས་པ་དག་ནི་རྣམ་པར་དག །མི་ནི་མང་པོ་ཚད་མེད་ཀྱང་།
en: Will develop sincere interest, And countless humans

source: །ཐེ་ཚོམ་དྲ་བ་ཆད་པར་གྱུར།
en: Will cut through the web of doubt.

source: །འདོད་ཆགས་རང་བཞིན་རབ་ཏུ་རྟོགས།
en: “They will realize the nature of desire,

source: །ཞེ་སྡང་གཏི་མུག་རྣམ་པར་བཤིག །སྲེད་དང་ང་རྒྱལ་མ་རིག་དང་། །གཡོ་སྒྱུ་ཕྲག་དོག་སྤྲོས་པ་ནས།
en: Eradicate anger and ignorance, And completely abandon

source: །སྡུག་བསྔལ་ཕུང་པོ་ལ་སོགས་པར། །ཐམས་ཅད་ཀྱང་ནི་ཡོངས་སུ་སྤངས།
en: The entire mass of suffering. “Suffering comes from the proliferation

source: །འདི་ལ་སོགས་པའི་ཚིག་གི་དོན།
en: Of craving, pride, Ignorance, deceit, and envy;

source: །མཐར་ནི་ཀུན་ཀྱང་རྣམ་པར་དག །དེ་བཞིན་གཤེགས་པས་ཆོས་གཅིག་ལ།
en: Ultimately, all those categories are pure.

source: །སྣ་ཚོགས་མིང་ནི་རབ་མཁྱེན་པས།
en: “Since the Thus-Gone One clearly knows

source: །གྲངས་ནི་བརྒྱ་སྟོང་མང་པོ་རྣམས།
en: The many terms related to every single Dharma teaching,

source: །བསམ་གྱིས་མི་ཁྱབ་རབ་ཏུ་སྟོན།
en: He delivers countless

source: །སངས་རྒྱས་ཚད་མེད་མང་པོ་ལས།
en: Hundreds of thousands of teachings.

source: །དེ་འདྲའི་ཆོས་ནི་ལེགས་བསླབས་པས།
en: “Since he has properly trained in the Dharma

source: །ཆོས་ཀྱི་དངོས་པོ་གཅིག་ལ་ཡང་།
en: Under countless buddhas,

source: །བརྗོད་པ་ཐུག་པ་མེད་པ་སྟོན།
en: The words he expresses to teach

source: །དེ་བཞིན་གཤེགས་པས་ཆོས་རྣམས་ཀྱི།
en: Every single Dharma topic are endless.

source: །རྣམ་གྲངས་སྣ་ཚོགས་རབ་མཁྱེན་པས།
en: “Since the Thus-Gone One knows The many categories of phenomena,

source: །མིང་ཚིག་དང་པོ་བར་མ་དང་། །ཐ་མ་རྣམ་འབྱེད་རབ་ཏུ་མཁྱེན།
en: He clearly understands the distinctions pertaining To initial, intermediate, and concluding statements. “Since he has learned

source: །ཐ་དད་ཚིག་ནི་སྣ་ཚོགས་དག །ཐམས་ཅད་རབ་ཏུ་བསླབས་པས་ན།
en: All the varieties of different words, He clearly knows how to teach

source: །དོན་མཆོག་དག་ནི་གྱ་ནོམ་པ། །སྟོན་པ་དག་ནི་རབ་ཏུ་མཁྱེན།
en: The excellent, supreme meanings.

source: །དེ་འདྲའི་དབྱངས་ནི་རྣམ་དག་པ།
en: “Since such a completely pure voice

source: །རྒྱུ་རྐྱེན་ཚོགས་པ་ལས་བྱུང་བས།
en: Originates from a collection of causes and conditions,

source: །ལྕེ་འབའ་ཞིག་ལ་རྟེན་པ་ནས།
en: It does not depend on the tongue alone,

source: །ལུས་སེམས་བར་ལ་རྟེན་པའང་མིན།
en: Or on the body and the mind alone.

source: །ས་ནི་རྣམ་པ་དྲུག་ཏུ་གཡོས།
en: “The earth has shaken in six ways,

source: །ཕྱོགས་བཅུའི་འཁོར་ནི་ཡོངས་འདུས་ནས།
en: And retinues have gathered from the ten directions.

source: །ཐལ་སྦྱར་བཅོམ་ལྡན་ཞལ་ལྟ་ན།
en: When they gaze upon the Blessed One, their palms joined,

source: །ཐེ་ཚོམ་དག་ནི་བསལ་དུ་གསོལ།
en: May their doubts be cleared away! “The Thus-Gone One realizes

source: །དེ་བཞིན་གཤེགས་པས་མིག་ཟད་དང་། །སྐྱེ་མཐའ་དག་ནི་རང་བཞིན་གྱིས།
en: That the limits of the exhaustion and arising of the eye

source: །རྟག་ཏུ་སྟོང་ཞིང་དབེན་པ་དང་། །འགྲོ་འོང་མེད་པར་རབ་ཏུ་མཁྱེན།
en: Are always intrinsically empty and void, Beyond coming and going. “He dwells within the very limit of reality,

source: །བཞུགས་དང་གནས་ནི་མི་མངའ་བས། །ཡང་དག་མཐའ་ལ་རབ་ཏུ་བཞུགས།
en: Beyond abiding and fixation.

source: །བཅོམ་ལྡན་སྤྱན་ནི་ཐོགས་མི་མངའ།
en: Blessed One, your eye is unimpeded,

source: །དེ་སླད་དེང་བདག་ཞུ་བ་ལགས།
en: So I ask you this today:

source: །དེ་བཞིན་གཤེགས་པས་མིག་ཉིད་ཀྱི།
en: “Since the Thus-Gone One realizes

source: །སྔོན་དང་ཕྱི་མའི་མཐའ་དག་དང་། །ཟད་དང་མ་ཟད་འཁོར་བ་ནི།
en: That the past and future limits of the eye, Its exhaustion and its non-exhaustion, as well as saṃsāra,

source: །རང་བཞིན་སྟོང་དབེན་རབ་མཁྱེན་པས།
en: Are intrinsically empty and void, “He brings delight to worldly beings

source: །ཆོས་ཀྱི་དོན་རྣམས་རབ་ཕྱེ་ནས། །འཇིག་རྟེན་རྣམས་ནི་དགའ་བར་མཛད།
en: By revealing the meanings of the Dharma.

source: །ཐུབ་པ་དབྱངས་སྙན་རབ་མངའ་བས། །ཅི་སླད་འཛུམ་པ་སྟོན་པར་མཛད།
en: Why does the sage, who is endowed With that melodious voice, smile?

source: །བཅོམ་ལྡན་སྔོན་དང་ཕྱི་མཐའ་དང་། །མིག་ཉིད་སྟོང་དབེན་རབ་མཁྱེན་ཅིང་།
en: “Blessed One, you realize that the past and future limits, As well as the eye, are empty and void,

source: །རྣམ་རྟོག་ཚིག་དང་བྲལ་ལགས་ན།
en: And you are free from concepts and words.

source: །ཅི་སླད་འཛུམ་པ་སྟོན་པར་མཛད།
en: Why do you smile?

source: །བཅོམ་ལྡན་མིག་ནི་དཔག་མེད་དང་། །བརྗོད་པ་སྣ་ཚོགས་རང་བཞིན་གྱིས།
en: “Blessed One, you know that the eye is beyond measure, And that the various verbal expressions

source: །རྟག་ཏུ་སྟོང་དབེན་མཁྱེན་ལགས་ན།
en: Are always empty and void by nature.

source: །བཅོམ་ལྡན་ཟད་དང་སྐྱེ་མཐའ་དང་། །མིག་ཉིད་སྟོང་དབེན་རབ་མཁྱེན་ཅིང་།
en: “Blessed One, you clearly know that the limits of exhaustion and arising, As well as the eye itself, are empty and void, And you have completely

source: །ཉོན་མོངས་རྣམས་ནི་ཡོངས་སྤངས་པས།
en: Abandoned all afflictions.

source: །སངས་རྒྱས་བྱང་ཆུབ་མཁྱེན་པ་བརྙེས།
en: “You have obtained the wisdom Of the buddhas’ awakening,

source: །གྲགས་པ་མཆོག་ནི་ཕུན་སུམ་ཚོགས།
en: And you have an excellent and supreme renown.

source: །བཅོམ་ལྡན་ཡུན་རིང་བསྒོམ་བསླབས་པས།
en: “Blessed One, since you have trained for a long time,

source: །བསམ་གྱིས་མི་ཁྱབ་སྟོན་པར་མཛད།
en: You teach the inconceivable.

source: །མིག་ཉིད་སྟོང་པ་ཉིད་དུ་མཁྱེན།
en: You realize the emptiness of the eye,

source: །དྲི་བྲལ་རྟག་ཏུ་རྣམ་པར་དག །སེམས་ཀྱི་སྤྱོད་པ་ཚད་མེད་རྣམས།
en: And you are always stainless and immaculate. “You know all the countless thoughts

source: །དགོངས་པ་གཅིག་གིས་ཐམས་ཅད་མཁྱེན།
en: Through a single realization.

source: །འོད་ཟེར་འཇིག་རྟེན་སྣང་མཛད་པ།
en: As your light rays illuminate the worlds,

source: །འདི་ནི་གང་གི་སྔ་རྟགས་ལགས།
en: What do these omens portend?

source: །དྲང་སྲོང་ཆེན་པོ་མངོན་སངས་རྒྱས།
en: “Great Sage, manifest Buddha,

source: །རྐང་གཉིས་གཙོ་བོ་ཁྱད་པར་འཕགས།
en: Exalted leader of human beings,

source: །ཉོན་མོངས་དག་ནི་རབ་བསལ་བས།
en: Since you have eliminated all afflictions,

source: །ཐུགས་ནི་རྟག་ཏུ་ཞི་ཞིང་དབེན།
en: Your mind is always peaceful and disengaged.

source: །དེ་བཞིན་གཤེགས་པ་མཁྱེན་མཆོག་གིས།
en: “Thus-Gone One, with your supreme wisdom

source: །མིག་ཟད་མཐའ་ནི་རབ་ཏུ་རྟོགས།
en: You know the limit of the exhaustion of the eye.

source: །རྒྱུ་དང་རྐྱེན་ནི་གང་གི་སླད།
en: Due to what causes and conditions

source: །དེང་འདིར་འཛུམ་པ་སྟོན་པར་མཛད།
en: Do you smile today? “The same applies to the ear, the nose,

source: །ཡུལ་དྲུག་དང་ནི་འབྱུང་ཆེན་བཞི།
en: The six sense objects, and the four great elements

source: །བཅོམ་ལྡན་མིག་ལ་བདག་མེད་མཁྱེན།
en: “Blessed One, you realize that the eye is selfless,

source: །རྣ་བ་མི་རྟག་ཉིད་དུ་རྟོགས།
en: That the ear is impermanent,

source: །སྣ་ཉིད་སྟོང་པར་རབ་མཁྱེན་ན།
en: And that the nose is empty.

source: །བཅོམ་ལྡན་ལྕེ་ལ་བདག་མེད་མཁྱེན།
en: “Blessed One, you realize that the tongue is selfless,

source: །ལུས་ཀྱང་མི་རྟག་ཉིད་དུ་རྟོགས།
en: That the body is impermanent,

source: །སེམས་ཡིད་སྟོང་པར་རབ་མཁྱེན་ན།
en: And that the mind is empty.

source: །བཅོམ་ལྡན་གཟུགས་ལ་བདག་མེད་མཁྱེན།
en: “Blessed One, you realize that forms are selfless,

source: །སྒྲ་ཡང་མི་རྟག་ཉིད་དུ་རྟོག །དྲི་ཉིད་སྟོང་པར་རབ་མཁྱེན་ན།
en: That sounds are impermanent, And that scents are empty.

source: །བཅོམ་ལྡན་རོ་ལ་བདག་མེད་མཁྱེན།
en: “Blessed One, you realize that tastes are selfless,

source: །རེག་བྱ་མི་རྟག་ཉིད་དུ་རྟོགས།
en: That touch is impermanent,

source: །ཆོས་ཉིད་སྟོང་པར་རབ་མཁྱེན་ན།
en: And that mental phenomena are empty.

source: །བཅོམ་ལྡན་ས་ལ་བདག་མེད་མཁྱེན།
en: “Blessed One, you realize that earth is selfless,

source: །ཆུ་ཡང་མི་རྟག་ཉིད་དུ་རྟོགས།
en: That water is impermanent,

source: །མེ་ཉིད་སྟོང་པར་རབ་མཁྱེན་ན།
en: And that fire is empty.

source: །བཅོམ་ལྡན་རླུང་ལ་བདག་མེད་མཁྱེན།
en: “Blessed One, you realize that air is selfless,

source: །ངོ་བོ་མི་རྟག་ཉིད་དུ་རྟོགས།
en: Essences are impermanent,

source: །དངོས་ཉིད་སྟོང་པར་རབ་མཁྱེན་ན།
en: And material things are empty.

source: །བཅོམ་ལྡན་འཇིག་རྟེན་བདག་མེད་མཁྱེན།
en: “Blessed One, you realize that the world is selfless,

source: །སྡུག་བསྔལ་མི་རྟག་ཉིད་དུ་རྟོགས།
en: That suffering is impermanent,

source: །ཕུང་པོ་སྟོང་པར་རབ་མཁྱེན་ན།
en: And that the aggregates are empty.

source: །བཅོམ་ལྡན་ཁམས་ལ་བདག་མེད་མཁྱེན།
en: “Blessed One, you realize that the elements are selfless,

source: །འཇིག་རྟེན་མི་རྟག་ཉིད་དུ་རྟོགས།
en: That the world is impermanent,

source: །སྐྱེ་ཉིད་སྟོང་པར་རབ་མཁྱེན་ན།
en: And that arising is empty.

source: །བཅོམ་ལྡན་སྒྲ་ལ་བདག་མེད་མཁྱེན།
en: “Blessed One, you realize that sounds are selfless,

source: །མིང་ཡང་མི་རྟག་ཉིད་དུ་རྟོགས།
en: That names are impermanent,

source: །ལམ་ཉིད་སྟོང་པར་རབ་མཁྱེན་ན།
en: And that the path is empty.

source: །བཅོམ་ལྡན་ཡེ་ཤེས་བདག་མེད་མཁྱེན།
en: “Blessed One, you realize that wisdom is selfless,

source: །རབ་དབེན་མི་རྟག་ཉིད་དུ་རྟོགས།
en: That disengagement is impermanent,

source: །སེམས་ཅན་སྟོང་པར་རབ་མཁྱེན་ན།
en: And that sentient beings are empty.

source: །བཅོམ་ལྡན་རང་བཞིན་རང་བཞིན་མེད།
en: “Blessed One, you realize that any nature lacks inherent nature,

source: །བདག་དང་བདག་མེད་པ་ཡང་མཁྱེན།
en: That the self is devoid of self,

source: །མོས་པ་སྟོང་པར་རབ་མཁྱེན་ན།
en: And that inclinations are empty.

source: །འཁོར་བ་བདག་མེད་ཉིད་དུ་གཟིགས།
en: “You see that saṃsāra is selfless,

source: །རྟག་དང་མི་རྟག་པ་ཡང་མཁྱེན།
en: You know what is permanent and impermanent,

source: །མྱ་ངན་འདས་པ་སྟོང་མཁྱེན་ན།
en: And you realize that nirvāṇa is empty.

source: །དེ་བཞིན་གཤེགས་པ་ཐུགས་རྣམ་གྲོལ།
en: “Thus-Gone One, your mind is free,

source: །གྲགས་པ་ཁམས་གསུམ་ཀུན་དུ་གང་།
en: Your renown pervades the entirety of the three realms, And you are worshiped by all beings,

source: །བརྒྱ་བྱིན་མི་ཡི་དབང་པོ་དང་། །ཀླུ་རྣམས་ལ་སོགས་ཀུན་གྱིས་མཆོད།
en: Such as Śakra, the rulers of human beings, and nāgas. “The Thus-Gone One realizes

source: །དེ་བཞིན་གཤེགས་པས་མིག་ཟད་དང་། །སྐྱེ་མཐའ་རབ་དབེན་མཁྱེན་ལགས་ན།
en: That the limits of the exhaustion And arising of the eye are void.

source: །སངས་རྒྱས་སྲས་ནི་ཚད་མེད་པ།
en: “All the countless heirs of the buddhas

source: །འཁོར་འདིར་ཐམས་ཅད་རབ་ཏུ་འདུས།
en: Have gathered in this retinue.

source: །སངས་རྒྱས་གསུང་ལས་སྐྱེས་པ་དང་། །ཆོས་ལས་སྤྲུལ་ཏེ་གང་བྱུང་བ།
en: They were born from the Buddha’s speech And emanated from the Dharma.

source: །ཐམས་ཅད་བཅོམ་ལྡན་སྤྱན་སྔར་མཆིས།
en: “They have come into the presence of the Blessed One

source: །གུས་པས་ཐལ་མོ་རབ་སྦྱར་ལགས།
en: And respectfully join their palms.

source: །འཁོར་འདུས་དེ་དག་སླད་དུ་ནི།
en: For those who have gathered in this assembly,

source: །འོད་ཟེར་རྒྱུ་རྐྱེན་འདི་ཞུ་ལགས།
en: I ask you to declare the causes and conditions of this light. “Since the Thus-Gone One realizes

source: །དེ་བཞིན་གཤེགས་པས་མིག་ཉིད་ནི། །སྟོང་ཞིང་བདག་མེད་མཁྱེན་པས་ན།
en: That the eye is empty and selfless, He truly surpasses

source: །ཁྱིམ་ན་གནས་པའི་རྣལ་འབྱོར་པ། །ཐམས་ཅད་ལས་ནི་ཡང་དག་འདས།
en: All householder practitioners.

source: །དེ་བཞིན་གཤེགས་པས་ཆོས་རྣམས་ནི།
en: “The Thus-Gone One knows

source: །བྱེ་བྲག་མེད་ཅིང་མཉམ་མཁྱེན་པས།
en: The lack of difference and the sameness of phenomena.

source: །བཅོམ་ལྡན་དགོངས་པ་རབ་མཁྱེན་གྱི།
en: Blessed One, you know this through your insight—

source: །རྫུ་འཕྲུལ་དག་གིས་གཟིགས་མ་ལགས།
en: You do not perceive this through your miraculous powers.

source: །ངོ་བོ་ཉིད་སྟོང་འགྲོ་འོང་མེད།
en: That its essence is empty, and that it does not come from or go anywhere—

source: །རྣམ་དག་མཁྱེན་པ་ཚད་མ་མཆིས།
en: Your immaculate wisdom is immeasurable.

source: །ཅི་སླད་འཛུམ་པ་སྟོན་པར་མཛད།། །།བམ་པོ་གསུམ་པ།
en: Why do you smile?

source: དེ་བཞིན་གཤེགས་པ་སྐྱེ་མཐའ་རབ་ཟད་པ།
en: “Thus-Gone One, your births are totally exhausted,

source: །ཐུགས་རྗེ་ཆེན་པོས་འཇིག་རྟེན་ཀུན་སྐྱོབ་མཛད།
en: And you protect all the worlds through your great compassion.

source: །ཆོས་རྗེ་མཆོག་གྱུར་མི་ཡི་གཙོར་གྱུར་པ།
en: Dharma lord, supreme leader of human beings,

source: །ཅི་སླད་འཛུམ་པ་བསྟན་མཛད་བཤད་དུ་གསོལ།
en: Please tell us why you smile!

source: །བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ཚད་མ་མཆིས།
en: “Countless great bodhisattvas

source: །གཞན་ཡང་ལྷ་ཚོགས་གཟི་བྱིན་ཆེ་བ་རྣམས།
en: And hosts of majestic gods

source: །མཁའ་ལ་གདུགས་ནི་དམ་པ་དག་ཀྱང་ཐོགས།
en: Are holding sublime parasols in the sky,

source: །ས་ཆེན་འདི་ནི་རབ་ཏུ་གཡོས་པར་གྱུར།
en: And this great earth has shaken. “You bring delight impartially to those Who have accomplished virtuous qualities

source: །གང་ཞིག་སྔོན་ནི་དེ་བཞིན་གཤེགས་པ་ལས། །ཡུན་རིང་དགེ་བའི་ཆོས་ནི་གང་བསྒྲུབས་པ།
en: For a long time under the thus-gone ones of the past.

source: །མཉམ་པར་དགའ་མཛད་ཐུགས་རྗེ་ཆེན་པོའི་གཙོ། །ཅི་སླད་འཛུམ་པ་བསྟན་མཛད་བཤད་དུ་གསོལ།
en: Great compassionate leader, please tell us why you smile!

source: །གང་ཞིག་སྔོན་ནི་སངས་རྒྱས་རབ་མཆོད་ནས།
en: “Those who have worshiped buddhas in the past

source: །ཆོས་འདི་ཐོས་ནས་དགའ་བ་རབ་སྐྱེས་པས།
en: Are filled with joy when they hear this teaching.

source: །འདྲེན་པ་རབ་མཆོག་མི་ཡི་གཙོར་གྱུར་པ།
en: Great guide, supreme leader of human beings,

source: །བཅོམ་ལྡན་གསུང་ནི་མང་པོ་དགའ་མཛད་པས།
en: “Blessed One, you please beings through your manifold teachings,
